In [12]:
#importing libraries
import pandas as pd
import numpy as np

#Creating Sample Datasets
da={
    'X':[1,2,3,np.nan,5],
    'Y':[5,6,4,7,8],
    'Z':[np.nan,2,3,4,np.nan]
}
df=pd.DataFrame(da)
print("Original DataFrame")
display(df)

df_dropna_rows=df.dropna()
print("/n DataFrame after dropping rows with any Nan Values:")
display(df_dropna_rows)


df_dropna_columns=df.dropna(axis=1)
print("/n DataFrame after dropping rows with any Nan Values:")
display(df_dropna_columns)


df_dropna_specific=df.dropna(subset=['X'])
print("/n DataFrame after dropping rows with any Nan Value in columnss 'X':")
display(df_dropna_specific)

Original DataFrame

     X  Y    Z
0  1.0  5  NaN
1  2.0  6  2.0
2  3.0  4  3.0
3  NaN  7  4.0
4  5.0  8  NaN

/n DataFrame after dropping rows with any Nan Values:

     X  Y    Z
1  2.0  6  2.0
2  3.0  4  3.0

/n DataFrame after dropping rows with any Nan Values:

   Y
0  5
1  6
2  4
3  7
4  8

/n DataFrame after dropping rows with any Nan Value in columnss 'X':

     X  Y    Z
0  1.0  5  NaN
1  2.0  6  2.0
2  3.0  4  3.0
4  5.0  8  NaN

In [21]:

import pandas as pd

data={
    'Product':['X','X','Y','Y','Z','Z','X','Y','Z'],
    'Region':['East','West','East','West','East','West','East','West','East'],
    'Sales':['Sim','Jack','Sim','Jack','Sim','Jack','Sim','Jack','Sim'],
    'Units':[12,15,28,31,19,13,22,33,22],
    'Profit':[299,400,289,399,488,299,488,288,374]
}
df=pd.DataFrame(data)
print("Original DataFrame:")
display(df)

pivot_table_units =pd.pivot_table(df,values="Units",index='Product',columns="Region",aggfunc="sum")
print("\n Pivot Table-Total Units by Product and Regions:")
display(pivot_table_units)


pivot_table_units =pd.pivot_table(df,values="Units",index='Product',columns="Sales",aggfunc="mean")
print("\n Pivot Table-Average profit per slaes for each product:")
display(pivot_table_units)


pivot_table_units =pd.pivot_table(df,values="Units",index='Product',columns="Region",aggfunc=['sum','mean'])
print("\n Pivot Table-Total and Average Units by Product and Regions:")
display(pivot_table_units)

Original DataFrame:

  Product Region Sales  Units  Profit
0       X   East   Sim     12     299
1       X   West  Jack     15     400
2       Y   East   Sim     28     289
3       Y   West  Jack     31     399
4       Z   East   Sim     19     488
5       Z   West  Jack     13     299
6       X   East   Sim     22     488
7       Y   West  Jack     33     288
8       Z   East   Sim     22     374

 Pivot Table-Total Units by Product and Regions:

Region   East  West
Product
X          34    15
Y          28    64
Z          41    13

 Pivot Table-Average profit per slaes for each product:

Sales    Jack   Sim
Product
X        15.0  17.0
Y        32.0  28.0
Z        13.0  20.5

 Pivot Table-Total and Average Units by Product and Regions:

         sum       mean
Region  East West  East  West
Product
X         34   15  17.0  15.0
Y         28   64  28.0  32.0
Z         41   13  20.5  13.0